
// Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16

//  Console.Write("Введите первое число: ");
// int A = int.Parse(Console.ReadLine()!);
//  Console.Write("Введите второе число: ");
// int B = int.Parse(Console.ReadLine()!);

// Console.WriteLine($"Результат возведения в степень {B} числа {A} = {GetExp(A)}");


// // // Методы
// int GetExp(int A){
// int exp = 1;

// for(int i = 1; i <= B; i++){
// exp *= A;
// }
// return exp;
// }



// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
// 452 -> 11
// 82 -> 10
// 9012 -> 12

 Console.Write("Введите число: ");
int A = int.Parse(Console.ReadLine()!);



// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран. (можно указать любой промежуток)
// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
// 6, 1, 33 -> [6, 1, 33]